package letcode.normal.medium;

/**
 * 石子游戏中，爱丽丝和鲍勃轮流进行自己的回合，爱丽丝先开始 。  有 n 块石子排成一排。
 * 每个玩家的回合中，可以从行中 移除 最左边的石头或最右边的石头，并获得与该行中剩余石头值之 和 相等的得分。当没有石头可移除时，得分较高者获胜。
 * 给你 n 块石子的数组 stones ，返回爱丽丝和鲍勃的得分的差值。
 * 鲍勃发现他总是输掉游戏（可怜的鲍勃，他总是输），所以他决定尽力 减小得分的差值 。爱丽丝的目标是最大限度地 扩大得分的差值 。
 * 给你一个整数数组 stones ，其中 stones[i] 表示 从左边开始 的第 i 个石头的值，如果爱丽丝和鲍勃都 发挥出最佳水平 ，请返回他们 得分的差值 。
 *
 * @author 蔡永程
 * @version 1.0.0
 * @since 2024/2/4 14:50
 */
public class _1690 {

    public int stoneGameVII(int[] stones) {
        /*
        5,3,1,4,2
        5 3 1 4 a13
        5 1 3 b9
        5 1 a6
        5 b5
         */
        return 0;
    }

}
