/*
 * 版权所有（c）<2021><蔡永程>
 *
 * 反996许可证版本1.0
 *
 * 在符合下列条件的情况下，特此免费向任何得到本授权作品的副本（包括源代码、文件和/或相关内容，以
 * 下统称为“授权作品”）的个人和法人实体授权：被授权个人或法人实体有权以任何目的处置授权作品，包括
 * 但不限于使用、复制，修改，衍生利用、散布，发布和再许可：
 *
 * 1. 个人或法人实体必须在许可作品的每个再散布或衍生副本上包含以上版权声明和本许可证，不得自行修
 * 改。
 * 2. 个人或法人实体必须严格遵守与个人实际所在地或个人出生地或归化地、或法人实体注册地或经营地（
 * 以较严格者为准）的司法管辖区所有适用的与劳动和就业相关法律、法规、规则和标准。如果该司法管辖区
 * 没有此类法律、法规、规章和标准或其法律、法规、规章和标准不可执行，则个人或法人实体必须遵守国际
 * 劳工标准的核心公约。
 * 3. 个人或法人不得以任何方式诱导、暗示或强迫其全职或兼职员工或其独立承包人以口头或书面形式同意
 * 直接或间接限制、削弱或放弃其所拥有的，受相关与劳动和就业有关的法律、法规、规则和标准保护的权利
 * 或补救措施，无论该等书面或口头协议是否被该司法管辖区的法律所承认，该等个人或法人实体也不得以任
 * 何方法限制其雇员或独立承包人向版权持有人或监督许可证合规情况的有关当局报告或投诉上述违反许可证
 * 的行为的权利。
 *
 * 该授权作品是"按原样"提供，不做任何明示或暗示的保证，包括但不限于对适销性、特定用途适用性和非侵
 * 权性的保证。在任何情况下，无论是在合同诉讼、侵权诉讼或其他诉讼中，版权持有人均不承担因本软件或
 * 本软件的使用或其他交易而产生、引起或与之相关的任何索赔、损害或其他责任。
 */

/**
 * @author Caiyongcheng
 * @version 1.0.0
 * @since 2023/9/27 11:28
 * description
 */
public class PrintSql {

    public static String getData() {
        return "623022000006 \t卓尼县申藏乡卫生院\t李建荣\t62302219811207637x\n" +
                "623022000006 \t卓尼县申藏乡卫生院\t何海云\t623022198302160000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t孙梦华\t623021198812163000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t蒋召第草\t623022198703260000 \t\t\t\n" +
                "623022000006 \t卓尼县申藏乡卫生院\t蒙兰英\t623022198811024000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t李梅英\t623022198811076000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t刘蓓\t62042219901103844x\n" +
                "623022000006 \t卓尼县申藏乡卫生院\t付卡主\t623022197406186000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t何广茂\t\n" +
                "623022000006 \t卓尼县申藏乡卫生院\t道知仁青\t623022198105295000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t王斌\t623022199109156000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t贺静静\t623021196402180000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t苟景春\t620102197505095000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t胡吉焕\t62302219650315601X\n" +
                "623022000006 \t卓尼县申藏乡卫生院\t宋玉林\t623022196807016000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t道知仁青\t623022198105295000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t杨永秀\t623022198812083000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t李慧\t623021198606180000 \n" +
                "623022000006 \t卓尼县申藏乡卫生院\t刘双龙\t623001198211163000 \n" +
                "623022000005 \t卓尼县杓哇土族乡卫生院\t开加劳\t623001197904141000 \n" +
                "623022000005 \t卓尼县杓哇土族乡卫生院\t杨春梅\t623022199402212000 \n" +
                "623022000005 \t卓尼县杓哇土族乡卫生院\t卢芳霞\t623022198901072000 \n" +
                "623022000005 \t卓尼县杓哇土族乡卫生院\t王琪\t623022198410106000 \n" +
                "623022000005 \t卓尼县杓哇土族乡卫生院\t张晓琴\t623022199203016000 \n" +
                "623022000005 \t卓尼县杓哇土族乡卫生院\t包万强\t623022199209022000 \n" +
                "623022000005 \t卓尼县杓哇土族乡卫生院\t尕藏肽岛\t623022198104275000 \n" +
                "623022000005 \t卓尼县杓哇土族乡卫生院\t刘新平\t623022199608103000 \n" +
                "623022000005 \t卓尼县杓哇土族乡卫生院\t仁欠吉\t623022198908246000 \n" +
                "623022000005 \t卓尼县杓哇土族乡卫生院\t董小霞\t623022199807043000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t管理员\t623022198901080000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t王金玉\t623022199007026000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t杨忠义\t623022198603101000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t卢振宏\t623022198901080000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t后建草\t623022196508211000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t赵瑞文\t623022197403151000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t包晓会\t623022199507022000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t王金玉\t623022199007026000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t赵瑞文\t623022197403151000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t张锁花\t623022199302062000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t张红梅\t623022198901122000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t乔满忠\t623022198610122000 \n" +
                "623022000017 \t卓尼县藏巴哇乡柏林卫生分院\t张红霞\t623022199304011000 \n";
    }

    public static String getTemplateHead() {
        return "insert into SYS_YHGL(yhid, jgid, yhxm,\n" +
                "                     yhpym, yhzh, password,\n" +
                "                     zjlx, zjhm, lxdh,\n" +
                "                     xb, zw, mz,\n" +
                "                     xl, sfjy, sfqk,\n" +
                "                     sfxp, bz, yhzt,\n" +
                "                     cjsj, cjry, xgsj,\n" +
                "                     xgry, sfzzm, sfzfm,\n" +
                "                     xxdz, ryzp, login_ip,\n" +
                "                     login_time, email, ksid, jxqk,\n" +
                "                     sfqdzyzs, PW_STATE) \n";
    }

    public static String getTemplateNeedFillItem() {
        //id, data[1], data[0], data[2], data.length < 4 ? "" : data[3], data.length < 4 ? "" : data[3]
        return "select %s,\n" +
                "       (select JGID from SYS_JGGL where JGMC = '%s' and JGDM = '%s '),\n" + //jgid
                "       '%s',\n" + //yhxm
                "       '',\n" +
                "       '%s' || 0,\n" + //yhzh
                "       '$2a$10$SwuqtY9opj3kA7B4P0qXluwf9QVc04ZDXokMQrIrrS/eK.eWLPWHG',\n" +
                "       '01',\n" +
                "       '%s',\n" + //zjhm
                "       '',\n" +
                "       '2',\n" +
                "       '2',\n" +
                "       '01',\n" +
                "       '20',\n" +
                "       '1',\n" +
                "       '1',\n" +
                "       '1',\n" +
                "       '20230927导入',\n" +
                "       '0',\n" +
                "       current_timestamp,\n" +
                "       '超级管理员',\n" +
                "       current_timestamp,\n" +
                "       '超级管理员',\n" +
                "       '',\n" +
                "       '',\n" +
                "       '',\n" +
                "       '',\n" +
                "       '',\n" +
                "       current_timestamp,\n" +
                "       '',\n" +
                "       '',\n" +
                "       '0',\n" +
                "       '1',\n" +
                "       '0'\n" +
                "from dual\n" +
                "union all\n";
    }

    public static String fillItem(String itemStr, String[] data, int idx, int id) {
        return String.format(itemStr, id, data[1].trim(), data[0].trim(), data[2].trim(), data.length < 4 ? "" : data[3].trim(), data.length < 4 ? "" : data[3].trim());
    }

    public static String getTemplateFill(String[] dataArr) {
        StringBuilder rst = new StringBuilder();
        String templateNeedFillItem = getTemplateNeedFillItem();
        for (int i = 0; i < dataArr.length; i++) {
            rst.append(fillItem(templateNeedFillItem, dataArr[i].split("\t"), i, i + 199999999));
        }
        return rst.toString();
    }

    public static void main(String[] args) {
        String data = getData();
        String[] dataSplit = data.split("\n");
        System.out.println(getTemplateHead() + getTemplateFill(dataSplit));
    }


}
