/*
 * 版权所有（c）<2021><蔡永程>
 *
 * 反996许可证版本1.0
 *
 * 在符合下列条件的情况下，特此免费向任何得到本授权作品的副本（包括源代码、文件和/或相关内容，以
 * 下统称为“授权作品”）的个人和法人实体授权：被授权个人或法人实体有权以任何目的处置授权作品，包括
 * 但不限于使用、复制，修改，衍生利用、散布，发布和再许可：
 *
 * 1. 个人或法人实体必须在许可作品的每个再散布或衍生副本上包含以上版权声明和本许可证，不得自行修
 * 改。
 * 2. 个人或法人实体必须严格遵守与个人实际所在地或个人出生地或归化地、或法人实体注册地或经营地（
 * 以较严格者为准）的司法管辖区所有适用的与劳动和就业相关法律、法规、规则和标准。如果该司法管辖区
 * 没有此类法律、法规、规章和标准或其法律、法规、规章和标准不可执行，则个人或法人实体必须遵守国际
 * 劳工标准的核心公约。
 * 3. 个人或法人不得以任何方式诱导、暗示或强迫其全职或兼职员工或其独立承包人以口头或书面形式同意
 * 直接或间接限制、削弱或放弃其所拥有的，受相关与劳动和就业有关的法律、法规、规则和标准保护的权利
 * 或补救措施，无论该等书面或口头协议是否被该司法管辖区的法律所承认，该等个人或法人实体也不得以任
 * 何方法限制其雇员或独立承包人向版权持有人或监督许可证合规情况的有关当局报告或投诉上述违反许可证
 * 的行为的权利。
 *
 * 该授权作品是"按原样"提供，不做任何明示或暗示的保证，包括但不限于对适销性、特定用途适用性和非侵
 * 权性的保证。在任何情况下，无论是在合同诉讼、侵权诉讼或其他诉讼中，版权持有人均不承担因本软件或
 * 本软件的使用或其他交易而产生、引起或与之相关的任何索赔、损害或其他责任。
 */

/**
 * @author Caiyongcheng
 * @version 1.0.0
 * @since 2023/9/27 11:28
 * description
 */
public class PrintSql {

    public static String getData() {
        return "卓尼县完冒镇卫生院\t杨建文\t623022196906206000 \t\n" +
                "卓尼县完冒镇卫生院\t完么扎西\t623022197904016000 \t13893961407 \n" +
                "卓尼县完冒镇卫生院\t张润霞\t623021198409095000 \t\n" +
                "卓尼县完冒镇卫生院\t那杰才让\t623022198904136000 \t\n" +
                "卓尼县完冒镇卫生院\t刘慧\t623022198704053000 \t\n" +
                "卓尼县完冒镇卫生院\t曹飞\t622326198201210000 \t13884083818 \n" +
                "卓尼县完冒镇卫生院\t戴金龙\t62212319851008005X\t15293288688 \n" +
                "卓尼县完冒镇卫生院\t道知仁青\t623022198105295000 \t\n" +
                "卓尼县完冒镇卫生院\t绒地草\t623022199402106000 \t\n" +
                "卓尼县完冒镇卫生院\t都个吉\t623022199001176000 \t\n" +
                "卓尼县完冒镇卫生院\t桑杰草\t623022199101156000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t包金芳\t623021199003101000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t朱海花\t623022198905061000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t王金贵\t623022200005266000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t马维喜\t620103197910091000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t赵桂贵\t623022199007026000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t金新巧\t623022198905061000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t朱素珍\t623022198506022000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t卢珊\t623022198905200000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t李永红\t623022198709224000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t张桃花\t62302219920510010X\t13629312773 \n" +
                "卓尼县喀尔钦镇卫生院大族分院\t卢孝芳\t623022199405182000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t马扎什\t623022199304274000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t旦知才让\t623022198106154000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t肖彦龙\t623022198609086000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t肖彦龙\t623022198609086000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t卢珊\t623022198905200000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t卢珊\t623022198905200000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t卢孝芳\t623022199405182000 \t\n" +
                "卓尼县喀尔钦镇卫生院大族分院\t旦知才让\t623022198106154000 \t\n" +
                "卓尼县尼巴镇卫生院\t云才让\t623022197806066000 \t13893999570 \n" +
                "卓尼县尼巴镇卫生院\t宗尕才让\t623022197303064000 \t13893938566 \n" +
                "卓尼县尼巴镇卫生院\t周加卡\t623022198608164000 \t\n" +
                "卓尼县尼巴镇卫生院\t旦知道杰\t623022198910124000 \t\n" +
                "卓尼县尼巴镇卫生院\t桑杰草\t623022198909256000 \t\n" +
                "卓尼县尼巴镇卫生院\t夏刀草\t623022199308105000 \t\n" +
                "卓尼县尼巴镇卫生院\t仁欠卓玛\t623022199311284000 \t15352276669 \n" +
                "卓尼县尼巴镇卫生院\t周加卡\t623022198310084000 \t13893952162 \n" +
                "卓尼县尼巴镇卫生院\t尕豆草\t623022199503145000 \t\n" +
                "卓尼县尼巴镇卫生院\t班地贡\t623022199104205000 \t\n" +
                "卓尼县尼巴镇卫生院\t才让刀杰\t623022198705024000 \t13893921313 \n" +
                "卓尼县尼巴镇卫生院\t默认\t623022198310084000 \t\n" +
                "卓尼县尼巴镇卫生院\t道吉次旦\t623022198605144000 \t\n" +
                "卓尼县尼巴镇卫生院\t苏奴卓玛\t623022199706054000 \t17339868692 \n" +
                "卓尼县尼巴镇卫生院\t尕藏才让\t623022199506094000 \t18194161256 \n" +
                "卓尼县尼巴镇卫生院\t万高\t623022197403157000 \t13150053189 \n" +
                "卓尼县尼巴镇卫生院\t彭克明\t623022199606086000 \t17630585034 \n" +
                "舟曲县曲告纳镇卫生院大年分院\t杨永成\t623023198408201000 \t18109413425 \n" +
                "舟曲县曲告纳镇卫生院大年分院\t肖龙江\t623023198512200000 \t15394037421 \n" +
                "舟曲县曲告纳镇卫生院大年分院\t秦次英草\t623023199502083000 \t\n" +
                "舟曲县曲告纳镇卫生院大年分院\t董生全\t623023198910063000 \t13893913162 \n" +
                "舟曲县曲告纳镇卫生院大年分院\t杨许兵\t623023199412100000 \t15209404854 \n" +
                "舟曲县曲告纳镇卫生院大年分院\t李小德\t623023199312083000 \t\n" +
                "舟曲县曲告纳镇卫生院大年分院\t白五斤\t623023196905214000 \t\n" +
                "舟曲县立节镇卫生院\t袁淑珍\t623023199605012000 \t\n" +
                "舟曲县立节镇卫生院\t何巧凤\t623023199801181000 \t\n" +
                "舟曲县立节镇卫生院\t王霞\t623023199303163000 \t\n" +
                "舟曲县立节镇卫生院\t薛宁\t623023197212101000 \t13884066523 \n" +
                "舟曲县立节镇卫生院\t张海林\t623027196504050000 \t\n" +
                "舟曲县立节镇卫生院\t格兴隆\t623023199011013000 \t18993693520 \n" +
                "舟曲县立节镇卫生院\t韩世平\t62302319890312301X\t\n" +
                "舟曲县立节镇卫生院\t肖三条\t623001198312101000 \t\n" +
                "舟曲县立节镇卫生院\t杨峰俊\t623023197308011000 \t\n" +
                "舟曲县立节镇卫生院\t谈文婧\t623023198809020000 \t\n" +
                "舟曲县立节镇卫生院\t薛宁\t623023197212101000 \t13884066523 \n" +
                "舟曲县立节镇卫生院\t鲁忠彦\t623023198203062000 \t\n" +
                "舟曲县立节镇卫生院\t赵贵春\t622623198605100000 \t\n" +
                "舟曲县立节镇卫生院\t肖瑶瑶\t623023199011161000 \t\n" +
                "舟曲县立节镇卫生院\t赵贵春\t622623198605100000 \t\n" +
                "舟曲县立节镇卫生院\t冯丽媛\t623023199609031000 \t\n" +
                "舟曲县立节镇卫生院\t刘新花\t623023200002211000 \t\n" +
                "舟曲县立节镇卫生院\t孙晓鸿\t623023197511092000 \t18194177253 \n" +
                "舟曲县立节镇卫生院\t杨磊\t622223198309145000 \t\n" +
                "舟曲县立节镇卫生院\t尚红霞\t623023199009182000 \t15101481237 \n" +
                "舟曲县立节镇卫生院\t尚红霞\t623023199009182000 \t\n" +
                "舟曲县立节镇卫生院\t杨满红\t623023198811151000 \t\n" +
                "舟曲县立节镇卫生院\t杨满红\t623023198811151000 \t\n" +
                "舟曲县立节镇卫生院\t韩俊亮\t62302319861016001X\t15349477773 \n" +
                "舟曲县立节镇卫生院\t王小芳\t623023200001241000 \t\n" +
                "舟曲县拱坝镇卫生院\t韩功民\t620103198509071000 \t\n" +
                "舟曲县拱坝镇卫生院\t罗九春\t623023199204101000 \t\n" +
                "舟曲县拱坝镇卫生院\t任朝林\t623001197808091000 \t\n" +
                "舟曲县拱坝镇卫生院\t任晓辉\t623023197001014000 \t\n" +
                "舟曲县拱坝镇卫生院\t尹卫军\t623023198209294000 \t\n" +
                "舟曲县拱坝镇卫生院\t王晓花\t623023197907104000 \t\n" +
                "舟曲县拱坝镇卫生院\t秦伟娟\t130130198511122000 \t\n" +
                "舟曲县拱坝镇卫生院\t于有木族\t623023199812014000 \t\n" +
                "舟曲县拱坝镇卫生院\t李萍\t623023199909191000 \t\n" +
                "舟曲县拱坝镇卫生院\t牛英喜\t623023199511084000 \t\n" +
                "舟曲县拱坝镇卫生院\t姚学花\t623023199709070000 \t\n" +
                "舟曲县拱坝镇卫生院\t余勿见措\t623023199512114000 \t\n" +
                "舟曲县拱坝镇卫生院\t薛许霞\t623023199602182000 \t\n" +
                "舟曲县拱坝镇卫生院\t吴继学\t623023197303174000 \t\n" +
                "舟曲县拱坝镇卫生院\t高晶晶\t620123198610134000 \t\n" +
                "舟曲县拱坝镇卫生院\t谈燕强\t623023198512070000 \t\n" +
                "舟曲县江盘镇卫生院\t朱仁杰\t62302719691224053X\t\n" +
                "舟曲县江盘镇卫生院\t李忠伟\t623023197008230000 \t\n" +
                "舟曲县江盘镇卫生院\t孙佛红\t623023197307120000 \t\n" +
                "舟曲县江盘镇卫生院\t杨菊琴\t623023197503080000 \t\n" +
                "舟曲县江盘镇卫生院\t关秋萍\t623023197310080000 \t\n" +
                "舟曲县江盘镇卫生院\t韩燕霞\t623023198104040000 \t\n" +
                "舟曲县江盘镇卫生院\t韩淑琴\t623023197811062000 \t\n" +
                "舟曲县江盘镇卫生院\t李香莲\t623023198011040000 \t\n" +
                "舟曲县江盘镇卫生院\t孙毅霞\t62302319861001002X\t\n" +
                "舟曲县江盘镇卫生院\t王玲\t620103198210131000 \t\n" +
                "舟曲县江盘镇卫生院\t杨琴\t623023197906070000 \t\n" +
                "舟曲县江盘镇卫生院\t金慧芳\t623023198209100000 \t\n" +
                "舟曲县江盘镇卫生院\t刘晓红\t623023196805170000 \t\n" +
                "舟曲县江盘镇卫生院\t李平\t623023198008270000 \t\n" +
                "舟曲县江盘镇卫生院\t苏香兰\t623023197710010000 \t\n" +
                "舟曲县江盘镇卫生院\t高小燕\t62302319831210002X\t\n" +
                "舟曲县武坪镇卫生院\t严鹏程\t62302319791118001X\t\n" +
                "舟曲县武坪镇卫生院\t王吴明\t623001197809021000 \t\n" +
                "舟曲县武坪镇卫生院\t桑条玉\t623023198912163000 \t\n" +
                "舟曲县武坪镇卫生院\t刘才让\t623023198505013000 \t\n" +
                "舟曲县武坪镇卫生院\t齐泉峰\t420202198310030000 \t\n" +
                "舟曲县武坪镇卫生院\t黄飞\t623023198603010000 \t\n" +
                "舟曲县武坪镇卫生院\t杨双剑\t623001197703281000 \t\n" +
                "舟曲县武坪镇卫生院\t左庆花\t62262619860502564X\t\n" +
                "舟曲县武坪镇卫生院\t桑伍军\t623023198603053000 \t\n" +
                "舟曲县武坪镇卫生院\t严鹏程\t62302319791118001X\t\n" +
                "舟曲县武坪镇卫生院\t桑兴荣\t623023199303283000 \t\n" +
                "舟曲县大川镇卫生院\t薛建章\t623023197608011000 \t\n" +
                "舟曲县大川镇卫生院\t韩华慧\t623023197808142000 \t\n" +
                "舟曲县大川镇卫生院\t刘蓉霞\t623023198606202000 \t\n" +
                "舟曲县大川镇卫生院\t王春平\t623027196701280000 \t\n" +
                "舟曲县大川镇卫生院\t刘安芳\t623023198502152000 \t\n" +
                "舟曲县大川镇卫生院\t桑萍英\t623023197303083000 \t\n" +
                "舟曲县大川镇卫生院\t杨九菊\t623023198909262000 \t\n" +
                "舟曲县大川镇卫生院\t闫银霞\t623023198903030000 \t\n" +
                "舟曲县大川镇卫生院\t杨丽萍\t623023198802130000 \t\n" +
                "舟曲县大川镇卫生院\t牟彦\t623023198703052000 \t\n" +
                "舟曲县大川镇卫生院\t王小兵\t623023197811033000 \t\n" +
                "舟曲县大川镇卫生院\t高艳丽\t623023197806290000 \t\n" +
                "舟曲县大川镇卫生院\t严肖霞\t623023198410112000 \t13893963826 \n" +
                "舟曲县大川镇卫生院\t王杨龙\t62302319961002221X\t\n" +
                "舟曲县大川镇卫生院\t奂晓秋\t623023199807022000 \t13239690658 \n" +
                "舟曲县大川镇卫生院\t王菊英\t62302319780806052X\t15101482258 \n" +
                "舟曲县大川镇卫生院\t杨卷霞\t623023198908200000 \t18368959804 \n" +
                "舟曲县大川镇卫生院\t李海朝\t623001198001171000 \t\n" +
                "舟曲县大川镇卫生院\t孙建玲\t623023198911020000 \t\n" +
                "舟曲县大川镇卫生院\t宁海霞\t623023198705010000 \t17794133223 \n" +
                "舟曲县果耶镇卫生院\t薛晓林\t623001197809151000 \t\n" +
                "舟曲县果耶镇卫生院\t尹俊贤\t62302319870323281X\t\n" +
                "舟曲县果耶镇卫生院\t杨小霞\t623023198711070000 \t\n" +
                "舟曲县果耶镇卫生院\t刘中明\t623023198809193000 \t\n" +
                "舟曲县果耶镇卫生院\t刘龙霞\t623023199001260000 \t\n" +
                "舟曲县果耶镇卫生院\t虎海莲\t623023199609123000 \t\n" +
                "舟曲县果耶镇卫生院\t谢学安\t620103198212121000 \t\n" +
                "舟曲县果耶镇卫生院\t尚玉芳\t623023199109023000 \t\n" +
                "舟曲县果耶镇卫生院\t王彦青\t623023198807080000 \t\n" +
                "舟曲县果耶镇卫生院\t高晓静\t623023199001200000 \t\n" +
                "舟曲县果耶镇卫生院\t刘文芳\t623023199412182000 \t\n" +
                "舟曲县果耶镇卫生院\t王彦青\t623023198807080000 \t\n" +
                "舟曲县八楞镇卫生院\t严妙芳\t623023199312202000 \t\n" +
                "舟曲县八楞镇卫生院\t韩学芳\t623023197208032000 \t\n" +
                "舟曲县八楞镇卫生院\t杨永强\t623023198901242000 \t\n" +
                "舟曲县八楞镇卫生院\t兰海玉\t622621199701103000 \t\n" +
                "舟曲县八楞镇卫生院\t郭春花\t623023198801253000 \t\n" +
                "舟曲县八楞镇卫生院\t杨香连\t623023199411272000 \t\n" +
                "舟曲县八楞镇卫生院\t牟西草\t623023199007153000 \t\n" +
                "舟曲县八楞镇卫生院\t牟永明\t623023196909100000 \t\n" +
                "舟曲县坪定镇卫生院\t尚义江\t622424198306156000 \t\n" +
                "舟曲县坪定镇卫生院\t冯晓斌\t623023198712120000 \t\n" +
                "舟曲县坪定镇卫生院\t杨毕军\t623023199101290000 \t\n" +
                "舟曲县坪定镇卫生院\t尹正辉\t623023198712250000 \t\n" +
                "舟曲县坪定镇卫生院\t杨慧丽\t62302319870713052X\t\n" +
                "舟曲县坪定镇卫生院\t杨红艳\t62302319831005002X\t\n" +
                "舟曲县坪定镇卫生院\t杨彩娟\t623023198810240000 \t\n" +
                "舟曲县坪定镇卫生院\t谈璞霞\t623023199303080000 \t\n" +
                "舟曲县坪定镇卫生院\t蒋军杰\t62010319790606103X\t\n" +
                "舟曲县坪定镇卫生院\t杨伟军\t620103198208071000 \t\n" +
                "舟曲县坪定镇卫生院\t李文菊\t623023198910200000 \t\n" +
                "舟曲县坪定镇卫生院\t赵娜娜\t410823198209250000 \t\n" +
                "舟曲县坪定镇卫生院\t薛晓丽\t623023198912011000 \t\n" +
                "舟曲县坪定镇卫生院\t谈江鹏\t623023198605060000 \t\n" +
                "舟曲县坪定镇卫生院\t杨芳辉\t623023198907110000 \t\n" +
                "舟曲县坪定镇卫生院\t谢淑红\t623023198410032000 \t\n" +
                "舟曲县坪定镇卫生院\t谈巧燕\t62302319860720056X\t\n" +
                "舟曲县坪定镇卫生院\t杨小江\t62302319990310004X\t\n" +
                "舟曲县坪定镇卫生院\t谈芬艳\t62302319850704052X\t\n" +
                "舟曲县博峪镇卫生院\t冯江平\t62302319921111001X\t\n" +
                "舟曲县博峪镇卫生院\t杨延平\t623023199008113000 \t\n" +
                "舟曲县博峪镇卫生院\t郭冷旦加措\t623023199012023000 \t\n" +
                "舟曲县博峪镇卫生院\t邓桂英\t623023199008163000 \t\n" +
                "舟曲县博峪镇卫生院\t金银芳\t623023198006284000 \t\n" +
                "舟曲县博峪镇卫生院\t余江文\t623023199606204000 \t\n" +
                "舟曲县博峪镇卫生院\t董金莲\t622326198709164000 \t\n" +
                "舟曲县博峪镇卫生院\t金主珠\t623023198907064000 \t\n" +
                "舟曲县博峪镇卫生院\t金江成\t623023199106234000 \t\n" +
                "舟曲县博峪镇卫生院\t袁方燕\t623023199407262000 \t\n" +
                "舟曲县博峪镇卫生院\t姚皓铭\t623023198804212000 \t\n" +
                "舟曲县博峪镇卫生院\t鲁杰\t623023199411102000 \t\n" +
                "舟曲县博峪镇卫生院\t牛世军\t623023198605114000 \t\n" +
                "舟曲县博峪镇卫生院\t田慧芳\t623023199507154000 \t\n" +
                "舟曲县博峪镇卫生院\t杨仁其措\t623023199612314000 \t\n" +
                "舟曲县博峪镇卫生院\t王鹏英\t623023199611020000 \t\n" +
                "舟曲县果耶镇卫生院池干分院\t何波\t623023198207130000 \t\n" +
                "舟曲县果耶镇卫生院池干分院\t韩永芳\t623023199709223000 \t\n" +
                "舟曲县果耶镇卫生院池干分院\t谈慧霞\t623023199408170000 \t\n" +
                "舟曲县果耶镇卫生院池干分院\t仇生荣\t623023196512073000 \t\n" +
                "舟曲县果耶镇卫生院池干分院\t杨小霞\t\t\n" +
                "舟曲县果耶镇卫生院池干分院\t朱宝华\t623023198707204000 \t\n" +
                "舟曲县果耶镇卫生院池干分院\t刘巧芳\t623023198809011000 \t\n" +
                "舟曲县果耶镇卫生院池干分院\t张英芳\t62302319900422302X\t\n" +
                "舟曲县果耶镇卫生院池干分院\t白军清\t623023198403112000 \t\n" +
                "夏河县阿木去乎镇牙利吉卫生院\t索南扎西\t623027198607234000 \t15293656335 \n" +
                "夏河县阿木去乎镇牙利吉卫生院\t旦正贡保\t623027197008184000 \t13893960719 \n" +
                "夏河县阿木去乎镇牙利吉卫生院\t久西草\t623027199406292000 \t\n" +
                "夏河县阿木去乎镇牙利吉卫生院\t才让东智\t623027198503202000 \t\n" +
                "夏河县阿木去乎镇牙利吉卫生院\t李彩红\t623027199209012000 \t\n" +
                "夏河县阿木去乎镇牙利吉卫生院\t拜晓艳\t623027199207110000 \t\n" +
                "夏河县阿木去乎镇牙利吉卫生院\t王英娣\t623027199510210000 \t\n" +
                "夏河县阿木去乎镇牙利吉卫生院\t旦正草\t623027198904124000 \t13893955512 \n" +
                "夏河县阿木去乎镇牙利吉卫生院\t贡保南杰\t623027198512163000 \t\n" +
                "夏河县阿木去乎镇牙利吉卫生院\t华旦才让\t623027199103071000 \t\n" +
                "夏河县阿木去乎镇牙利吉卫生院\t金代吉\t623027199102101000 \t\n" +
                "夏河县阿木去乎镇牙利吉卫生院\t仁欠南杰\t623027198905264000 \t18368956067 \n" +
                "夏河县阿木去乎镇牙利吉卫生院\t刘红菊\t622921199012166000 \t\n" +
                "夏河县阿木去乎镇牙利吉卫生院\t周加才让\t62302719820428141X\t13893959282 \n" +
                "夏河县阿木去乎镇牙利吉卫生院\t才让卓玛\t62302719900827142X\t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t王学龙\t623021196711095000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t付锦童\t623021197501152000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t王继贤\t623021197009250000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t魏成栋\t623021197904250000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t晏鸿荣\t62010319740828103X\t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t王喜红\t623021197511181000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t成喜春\t623021198602025000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t何小鹏\t623021199112075000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t马艳红\t623021198704183000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t张桃芳\t623021198402015000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t李桂君\t623021198709135000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t李晓霞\t623021198306041000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t高彦红\t623021199303245000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t李海霞\t623021198809215000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t焦志梅\t623122198311061000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t旦正吉\t623001199205083000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t康佐胜\t623021199611135000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t李淑霞\t623021199306275000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t闫明霞\t623021199108275000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t马慧慧\t622727199308284000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t孙子清\t623021199703285000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t石红红\t623021196906025000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t闫玉霞\t623021198405295000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t杨红梅\t623021196602085000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t李志德\t623021196902095000 \t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t王爱萍\t62302319700930222x\t\n" +
                "甘南州临潭县冶力关镇中心卫生院\t孔令娟\t623021198706135000 \t\n" +
                "甘南州临潭县店子镇中心卫生院\t王志燕\t623021199609184000 \t15379404078 \n" +
                "甘南州临潭县店子镇中心卫生院\t张志强\t623021197201213000 \t13893930188 \n" +
                "甘南州临潭县店子镇中心卫生院\t张海龙\t623021198404163000 \t15390626711 \n" +
                "甘南州临潭县店子镇中心卫生院\t丁国强\t623021198501031000 \t13893936416 \n" +
                "甘南州临潭县店子镇中心卫生院\t李玲\t623021199507262000 \t15209412665 \n" +
                "甘南州临潭县店子镇中心卫生院\t切江草\t623027199012294000 \t13399419821 \n" +
                "甘南州临潭县店子镇中心卫生院\t张红霞\t623021199705203000 \t13893935397 \n" +
                "甘南州临潭县店子镇中心卫生院\t王巧辉\t623021198805094000 \t15349473415 \n" +
                "甘南州临潭县店子镇中心卫生院\t姜明霞\t623021199710023000 \t17361613986 \n" +
                "甘南州临潭县店子镇中心卫生院\t武筱珍\t62302119900328272X\t13150003008 \n" +
                "甘南州临潭县洮滨镇新堡卫生院\t李谢军\t623021199308242000 \t\n" +
                "甘南州临潭县洮滨镇新堡卫生院\t周景云\t623021197001202000 \t\n" +
                "甘南州临潭县洮滨镇新堡卫生院\t秦惠珍\t623021198206133000 \t\n" +
                "甘南州临潭县洮滨镇新堡卫生院\t朱桂兰\t623021199005132000 \t\n" +
                "甘南州临潭县洮滨镇新堡卫生院\t田彦军\t642222198408063000 \t\n" +
                "甘南州临潭县洮滨镇新堡卫生院\t孙全武\t622822198303054000 \t\n" +
                "甘南州临潭县洮滨镇新堡卫生院\t李秋菊\t623021198610173000 \t\n" +
                "甘南州临潭县洮滨镇新堡卫生院\t杜红斌\t623021197104012000 \t\n" +
                "甘南州临潭县洮滨镇新堡卫生院\t席文媛\t622421199212032000 \t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t李颜华\t623021198605041000 \t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t鲁瑞红\t623021199402154000 \t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t强永禄\t623021197606231000 \t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t李胜强\t622727198312107000 \t15109445609 \n" +
                "甘南州临潭县王旗镇龙元卫生院\t武亚梅\t623021199912154000 \t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t李玉顺\t62302119950413301X\t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t斗格吉\t623027198809184000 \t15390622256 \n" +
                "甘南州临潭县王旗镇龙元卫生院\t宼树琴\t623021199310234000 \t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t孙梅萍\t620422199512215000 \t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t王巧红\t62302219901011152x\t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t侯军\t623021198012074000 \t13884064035 \n" +
                "甘南州临潭县王旗镇龙元卫生院\t王云\t62302119980610007X\t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t晏蓉蓉\t623021199811032000 \t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t赵文霞\t623021199805194000 \t\n" +
                "甘南州临潭县王旗镇龙元卫生院\t鲁胜霞\t623021200205084000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t殷建红\t623021198312262000 \t13884071668 \n" +
                "甘南州临潭县流顺镇卫生院\t包寿贵\t623022198502040000 \t13893986679 \n" +
                "甘南州临潭县流顺镇卫生院\t雍玉春\t623021198910011000 \t15293644153 \n" +
                "甘南州临潭县流顺镇卫生院\t金吉环\t620121198912266000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t杨英英\t62302119890819552x\t18919298840 \n" +
                "甘南州临潭县流顺镇卫生院\t杨文晓\t623021199303031000 \t13893945208 \n" +
                "甘南州临潭县流顺镇卫生院\t苟发信\t620403198110130000 \t15337099982 \n" +
                "甘南州临潭县流顺镇卫生院\t梁开斌\t622301197409100000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t王萍芳\t623021197711170000 \t13209413452 \n" +
                "甘南州临潭县流顺镇卫生院\t徐云娥\t623021199503192000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t宁彩霞\t623021199404091000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t徐云娥\t623021199503192000 \t18189603538 \n" +
                "甘南州临潭县流顺镇卫生院\t宁彩霞\t623021199404091000 \t18194184240 \n" +
                "甘南州临潭县流顺镇卫生院\t宁风琴\t623021199311031000 \t18194173854 \n" +
                "甘南州临潭县流顺镇卫生院\t王萍芳\t623021197711170000 \t13209413452 \n" +
                "甘南州临潭县流顺镇卫生院\t张建峰\t62302119980520191x\t18119308462 \n" +
                "甘南州临潭县流顺镇卫生院\t张海珍\t623021199603141000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t王萍芳\t623021197711170000 \t13209413452 \n" +
                "甘南州临潭县流顺镇卫生院\t张海珍\t623021199603141000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t万高\t623022197403157000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t闫慧梅\t62302119890510168x\t\n" +
                "甘南州临潭县流顺镇卫生院\t俞天贤\t623021197510101000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t孙肇文\t623021198709082000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t王卓琴\t623001197110071000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t杨海龙\t623021199301181000 \t\n" +
                "甘南州临潭县流顺镇卫生院\t俞天贤\t623021197510101000 \t13893905120 \n" +
                "甘南州临潭县流顺镇卫生院\t周娜\t620421198901105000 \t18393803988 \n" +
                "甘南州临潭县羊沙镇卫生院\t韩杰伟\t622901198512062000 \t18089408851 \n" +
                "甘南州临潭县羊沙镇卫生院\t周永锋\t623021197910225000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t李俊发\t623021198604212000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t成海燕\t623021198509105000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t王小琴\t623021198809265000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t丁润军\t623021199212275000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t陈亚芳\t623021199310175000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t陈小霞\t623021199310025000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t杨秀春\t623021197510281000 \t13209417588 \n" +
                "甘南州临潭县羊沙镇卫生院\t林慧萍\t623021197110154000 \t18719534900 \n" +
                "甘南州临潭县羊沙镇卫生院\t魏丽\t622726197209070000 \t13519423554 \n" +
                "甘南州临潭县羊沙镇卫生院\t魏丽\t622726197209070000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t邱翠莲\t623022199506226000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t杨彩霞\t623021199203101000 \t15352286808 \n" +
                "甘南州临潭县羊沙镇卫生院\t杨丽丽\t623021200102135000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t马安平\t623021198203095000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t王天国\t620121199907195000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t刘兴海\t623021198211195000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t王梅\t623021199301124000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t武海平\t62302119851004131X\t\n" +
                "甘南州临潭县羊沙镇卫生院\t韩杰伟\t623021198512062000 \t\n" +
                "甘南州临潭县羊沙镇卫生院\t刘建华\t623021199808125000 \t\n" +
                "甘南州临潭县长川卫生院\t范兴平\t622901198612283000 \t13629318123 \n" +
                "甘南州临潭县长川卫生院\t张仲良\t623021197209120000 \t138939910588 \n" +
                "甘南州临潭县长川卫生院\t于志荣\t623021197001101000 \t13884079218 \n" +
                "甘南州临潭县长川卫生院\t孙俊玲\t623021199909121000 \t15390624867 \n" +
                "甘南州临潭县长川卫生院\t王金雁\t623021199809130000 \t15693033125 \n" +
                "甘南州临潭县长川卫生院\t靳紫珍\t620302199805101000 \t17352172214 \n" +
                "甘南州临潭县长川卫生院\t武海平\t62300119851004131X\t15209410461 \n" +
                "甘南州临潭县长川卫生院\t李文达\t623021197705160000 \t18194184525 \n" +
                "甘南州临潭县长川卫生院\t袁芳\t623021199202081000 \t18298656504 \n" +
                "甘南州临潭县长川卫生院\t杨世伟\t623021199102171000 \t18093931263 \n" +
                "甘南州临潭县长川卫生院\t袁丽华\t362130198209240000 \t\n" +
                "甘南州临潭县长川卫生院\t马琴霞\t62302119940110454X\t18309419135 \n" +
                "甘南州临潭县长川卫生院\t李桂菊\t623021199307041000 \t18368942280 \n" +
                "甘南州临潭县长川卫生院\t刘德梅\t62302119940318132X\t18719510468 \n" +
                "甘南州临潭县长川卫生院\t丁忠花\t623021200107110000 \t13239411005 \n" +
                "甘南州临潭县长川卫生院\t王斌成\t623021199912083000 \t13897158298 \n" +
                "甘南州临潭县长川卫生院\t桑吉草\t623025199810210000 \t17361613772 ";
    }

    public static String getTemplateHead() {
        return "insert into SYS_YHGL(yhid, jgid, yhxm,\n" +
                "                     yhpym, yhzh, password,\n" +
                "                     zjlx, zjhm, lxdh,\n" +
                "                     xb, zw, mz,\n" +
                "                     xl, sfjy, sfqk,\n" +
                "                     sfxp, bz, yhzt,\n" +
                "                     cjsj, cjry, xgsj,\n" +
                "                     xgry, sfzzm, sfzfm,\n" +
                "                     xxdz, ryzp, login_ip,\n" +
                "                     login_time, email, ksid, jxqk,\n" +
                "                     sfqdzyzs, PW_STATE) \n";
    }

    public static String getTemplateNeedFillItem() {
        //id, jgmc, yhxm, yhzh, zjhm, lxdh
        return "select %s,\n" +
                "       (select JGID from SYS_JGGL where JGMC = '%s'),\n" + //jgmc
                "       '%s',\n" + //yhxm
                "       '',\n" +
                "       '%s' || 0,\n" + //yhzh
                "       '$2a$10$SwuqtY9opj3kA7B4P0qXluwf9QVc04ZDXokMQrIrrS/eK.eWLPWHG',\n" +
                "       '01',\n" +
                "       '%s',\n" + //zjhm
                "       '%s',\n" + //lxdh
                "       '2',\n" +
                "       '2',\n" +
                "       '01',\n" +
                "       '20',\n" +
                "       '1',\n" +
                "       '1',\n" +
                "       '1',\n" +
                "       '20231007导入',\n" +
                "       '0',\n" +
                "       current_timestamp,\n" +
                "       '超级管理员',\n" +
                "       current_timestamp,\n" +
                "       '超级管理员',\n" +
                "       '',\n" +
                "       '',\n" +
                "       '',\n" +
                "       '',\n" +
                "       '',\n" +
                "       current_timestamp,\n" +
                "       '',\n" +
                "       '',\n" +
                "       '0',\n" +
                "       '1',\n" +
                "       '0'\n" +
                "from dual\n" +
                "union all\n";
    }

    public static String fillItem(String itemStr, String[] data, int idx, int id) {
        //id, jgdm, yhxm, yhzh, zjhm, lxdh
        return String.format(itemStr, id, data[0].trim(), data[1].trim(), id, data.length < 3 ? "" : data[2].trim(), data.length < 4 ? "" : data[3].trim());
    }

    public static String getTemplateFill(String[] dataArr) {
        StringBuilder rst = new StringBuilder();
        String templateNeedFillItem = getTemplateNeedFillItem();
        for (int i = 0; i < dataArr.length; i++) {
            rst.append(fillItem(templateNeedFillItem, dataArr[i].split("\t"), i, i + 299999999));
        }
        return rst.toString();
    }

    public static void main(String[] args) {
        String data = getData();
        String[] dataSplit = data.split("\n");
        System.out.println(getTemplateHead() + getTemplateFill(dataSplit));
    }


}
